Rechnerubung/Week8/turbulent_channel_ht/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type                    mapped;
        value                   $internalField;
        setAverage              true;
        average                 (1.3452 0 0);
        interpolationScheme     cell;
    }
    outlet
    {
        type            zeroGradient;
    }

    fixedWalls-bottom
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    fixedWalls-top
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
